FKDD_COPY_DIFF_3_2026-02-13/DataProcessors/РассылкаИнформацииОБонусныхБаллах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РассылкаИнформацииОБонусныхБаллах</Name>
			<Comment>Рассылка информации о бонусных баллах</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонРассылкиSMS</Name>
					<Comment>Шаблон рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстовыхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпановкиДанных</Name>
					<Comment>Схема компанивки данных</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонРассылкиEMail</Name>
					<Comment>Шаблон рассылки e-mail</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстовыхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляРассылки</Name>
					<Comment>Данные для рассылки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БонуснаяПрограмма</Name>
							<Comment>Бонусная программа</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.БонусныеПрограммы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Карточка</Name>
							<Comment>Карточка</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество баллов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСписания</Name>
							<Comment>Дата списания</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьEMailРассылку</Name>
							<Comment>Использовать email-рассылку</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьSMSРассылку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Поле в котором хранится телефонный номер</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/КодГруппыАдресаЭлектронногоПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КодГруппыАдресаЭлектронногоПисьма</Name>
			<Comment>Перечисление кодов группы адреса электронного письма</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кому</Name>
					<Comment>Кому</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Копии</Name>
					<Comment>Копия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкрытыеКопии</Name>
					<Comment>Скрытая копия</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/DataProcessors/РассылкаИнформацииОБонусныхБаллах/Ext/ObjectModule.bsl
Функция киКонтрагентов(Контрагенты)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект КАК Контрагент,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект В(&Контрагенты)
	|	И КонтактнаяИнформация.Вид В(&ВидыКИ)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Представление";
	
	ВидыКИ = Новый Массив;
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.УстановитьПараметр("ВидыКИ", ВидыКИ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьДанныеДляРассылки() Экспорт
	
	Если СхемаКомпановкиДанных = Неопределено Тогда
		СхемаКомпановкиДанных = ПолучитьМакет("Макет");
		КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпановкиДанных));
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпановкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;
	
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпановкиДанных));
	КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпановкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроекКомпоновкиДанных.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодТекущий", Дата);
	
	ТаблицаРезультат = Новый ТаблицаЗначений();
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпановкиДанных, КомпоновщикНастроекКомпоновкиДанных.Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	ПроцессорВывода.ЗакончитьВывод();
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ВыполнитьРассылку() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ШаблонРассылкиSMS) И НЕ ЗначениеЗаполнено(ШаблонРассылкиEMail) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДанныеДляРассылки.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// поуичим контактную информацию контрагента
	КИКонтрагентов = КИКонтрагентов(ДанныеДляРассылки.ВыгрузитьКолонку("Контрагент"));
	
	// отправим по e-mail
	ДокументыКОтправке = Новый Массив; ДокументSMS = Неопределено; АдресатыSMS = "";
	Для Каждого Рассылка Из ДанныеДляРассылки Цикл
		Если Рассылка.ИспользоватьEMailРассылку И ЗначениеЗаполнено(ШаблонРассылкиEMail) Тогда
			// проверим есть ли e-mail
			Email = КИКонтрагентов.НайтиСтроки(Новый Структура("Контрагент,Вид", Рассылка.Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний));
			Если Email.Количество() > 0 Тогда
				// создадим документ
				НовоеЭлектронноеПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
				НовоеЭлектронноеПисьмо.Заполнить(Неопределено);
				НовоеЭлектронноеПисьмо.ОбменДанными.Загрузка    = Истина;
				НовоеЭлектронноеПисьмо.УчетнаяЗапись            = УчетнаяЗаписьЭлектроннойПочты;
				НовоеЭлектронноеПисьмо.ОтправительПредставление = УчетнаяЗаписьЭлектроннойПочты.АдресЭлектроннойПочты;
				НовоеЭлектронноеПисьмо.ГруппаПисем              = Справочники.ГруппыПисемЭлектроннойПочты.НайтиПоНаименованию("Исходящие");
				НовоеЭлектронноеПисьмо.ФорматТекста             = Перечисления.ФорматТекста.ПростойТекст;
				НовоеЭлектронноеПисьмо.Комментарий              = "Создан регламентным заданием";
				
				Получатель = НовоеЭлектронноеПисьмо.Получатели.Добавить();
				Получатель.АдресЭлектроннойПочты = Email[0].Представление;
				Получатель.СсылкаНаОбъект        = Рассылка.Контрагент;
				Получатель.Представление         = Email[0].Представление;
				Получатель.КодГруппыАдреса       = Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому;
				
				НовоеЭлектронноеПисьмо.Тема        = "Оповещение о бонусах";
				НовоеЭлектронноеПисьмо.ТекстПисьма = Справочники.ШаблоныТекстовыхСообщений.ЗаполнитьШаблонПоОбъекту(ШаблонРассылкиEMail, Рассылка);
				
				НовоеЭлектронноеПисьмо.Записать();
				
				ДокументыКОтправке.Добавить(НовоеЭлектронноеПисьмо);
			КонецЕсли;
		КонецЕсли;
		
		Если Рассылка.ИспользоватьSMSРассылку
			И ЗначениеЗаполнено(ШаблонРассылкиSMS)
			И Рассылка.Контрагент.СогласиеНаПолучениеSMS Тогда
			НомерТелефона = КИКонтрагентов.НайтиСтроки(Новый Структура("Контрагент,Вид", Рассылка.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонСотовый));
			Если НомерТелефона.Количество() > 0 Тогда
				Если ДокументSMS = Неопределено Тогда
					ДокументSMS = Документы.SMS.СоздатьДокумент();
					ДокументSMS.Заполнить(Неопределено);
					ДокументSMS.УстановитьНовыйНомер();
					
					ДокументSMS.НомерОтправителя = Константы.смсИмяПользователяПоУмолчанию.Получить();
					ДокументSMS.НачалоОтправки   = ТекущаяДата();
					ДокументSMS.ТекстСообщения   = ШаблонРассылкиSMS;
					
					ДокументSMS.Входящее_Исходящее = Перечисления.ТипыСообщений.Исходящее;
					ДокументSMS.Комментарий        = "Создан регламентным заданием";
				КонецЕсли;
				
				Получатель = ДокументSMS.Получатели.Добавить();
				Получатель.ВладелецКИ    = Рассылка.Контрагент;
				Получатель.НомерТелефона = НомерТелефона[0].Представление;
				Получатель.Контрагент    = Рассылка.Контрагент;
				
				АдресатыSMS = АдресатыSMS + ?(ПустаяСтрока(АдресатыSMS), "", ", ") + спПолучитьНаименование(Получатель.Контрагент);
				
				Получатель.ТекстСообщения = Справочники.ШаблоныТекстовыхСообщений.ЗаполнитьШаблонПоОбъекту(ШаблонРассылкиSMS, Рассылка);;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ДокументыКОтправке.Количество() > 0 И НЕ УчетнаяЗаписьЭлектроннойПочты.Пустая() Тогда
		Попытка
			СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
			СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(УчетнаяЗаписьЭлектроннойПочты, СтруктураРежимовОбмена);
			Если СоединениеСПочтовымСервером <> Неопределено Тогда
				Для Каждого ДокументEMail Из ДокументыКОтправке Цикл
					эпОтправитьПисьмо(ДокументEMail, СоединениеСПочтовымСервером);
					#Если Клиент Тогда
						Сообщить(НСтр("ru = 'Отправлено электронное письмо '") + Строка(ДокументEMail.Ссылка));
					#КонецЕсли
				КонецЦикла;
				эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если ДокументSMS <> Неопределено Тогда
		Попытка
			ДокументSMS.Записать(РежимЗаписиДокумента.Запись);
			#Если Клиент Тогда
				Сообщить(НСтр("ru = 'Сформирован документ sms для адресатов: '") + АдресатыSMS);
			#КонецЕсли
			ДокументSMS.ОтправитьSMS();
		Исключение
			ИнформацияООшибке = ИнформацияОбОшибке();
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

Функция АвтоматическаяРассылка() Экспорт
	
	ДанныеДляРассылки.Загрузить(ПолучитьДанныеДляРассылки());
	
	ВыполнитьРассылку();
	
КонецФункции
